public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_update_index_run3.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 666.52 qps: 666.52 (r/w/o: 0.00/666.52/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 686.30 qps: 686.30 (r/w/o: 0.00/686.30/0.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 700.50 qps: 700.50 (r/w/o: 0.00/700.50/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 736.90 qps: 736.90 (r/w/o: 0.00/736.90/0.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 824.30 qps: 824.30 (r/w/o: 0.00/824.30/0.00) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 676.20 qps: 676.20 (r/w/o: 0.00/676.20/0.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 533.90 qps: 533.90 (r/w/o: 0.00/533.90/0.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 798.90 qps: 798.90 (r/w/o: 0.00/798.90/0.00) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 920.00 qps: 920.00 (r/w/o: 0.00/920.00/0.00) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 709.80 qps: 709.80 (r/w/o: 0.00/709.80/0.00) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 739.40 qps: 739.40 (r/w/o: 0.00/739.40/0.00) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 877.10 qps: 877.10 (r/w/o: 0.00/877.10/0.00) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           88715
        other:                           0
        total:                           88715
    transactions:                        88715  (738.46 per sec.)
    queries:                             88715  (738.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      738.4551
    time elapsed:                        120.1359s
    total number of events:              88715

Latency (ms):
         min:                                    0.05
         avg:                                   21.66
         max:                                 1572.92
         95th percentile:                       65.65
         sum:                              1921861.02

Threads fairness:
    events (avg/stddev):           5544.6875/41.54
    execution time (avg/stddev):   120.1163/0.01