public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_update_non_index_run2.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1747.99 qps: 1747.99 (r/w/o: 0.00/1747.99/0.00) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1604.61 qps: 1604.61 (r/w/o: 0.00/1604.61/0.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1523.00 qps: 1523.00 (r/w/o: 0.00/1523.00/0.00) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1535.10 qps: 1535.10 (r/w/o: 0.00/1535.10/0.00) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1768.70 qps: 1768.70 (r/w/o: 0.00/1768.70/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1349.00 qps: 1349.00 (r/w/o: 0.00/1349.00/0.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1700.10 qps: 1700.10 (r/w/o: 0.00/1700.10/0.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1554.80 qps: 1554.80 (r/w/o: 0.00/1554.80/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 1387.80 qps: 1387.80 (r/w/o: 0.00/1387.80/0.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1582.00 qps: 1582.00 (r/w/o: 0.00/1582.00/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1900.20 qps: 1900.20 (r/w/o: 0.00/1900.20/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1512.79 qps: 1512.79 (r/w/o: 0.00/1512.79/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           191677
        other:                           0
        total:                           191677
    transactions:                        191677 (1596.83 per sec.)
    queries:                             191677 (1596.83 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1596.8334
    time elapsed:                        120.0357s
    total number of events:              191677

Latency (ms):
         min:                                    0.03
         avg:                                   10.02
         max:                                  706.57
         95th percentile:                       28.16
         sum:                              1920043.82

Threads fairness:
    events (avg/stddev):           11979.8125/47.06
    execution time (avg/stddev):   120.0027/0.01