public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_update_non_index_run3.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1978.66 qps: 1978.66 (r/w/o: 0.00/1978.66/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1534.50 qps: 1534.50 (r/w/o: 0.00/1534.50/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1438.20 qps: 1438.20 (r/w/o: 0.00/1438.20/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1676.90 qps: 1676.90 (r/w/o: 0.00/1676.90/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1727.70 qps: 1727.70 (r/w/o: 0.00/1727.70/0.00) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1492.90 qps: 1492.90 (r/w/o: 0.00/1492.90/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1889.40 qps: 1889.40 (r/w/o: 0.00/1889.40/0.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1494.20 qps: 1494.20 (r/w/o: 0.00/1494.20/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 2315.50 qps: 2315.50 (r/w/o: 0.00/2315.50/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1170.80 qps: 1170.80 (r/w/o: 0.00/1170.80/0.00) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1179.80 qps: 1179.80 (r/w/o: 0.00/1179.80/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           199907
        other:                           0
        total:                           199907
    transactions:                        199907 (1665.87 per sec.)
    queries:                             199907 (1665.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1665.8705
    time elapsed:                        120.0015s
    total number of events:              199907

Latency (ms):
         min:                                    0.04
         avg:                                    9.60
         max:                                  705.13
         95th percentile:                       27.17
         sum:                              1919870.25

Threads fairness:
    events (avg/stddev):           12494.1875/32.34
    execution time (avg/stddev):   119.9919/0.00