public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/tidesdb_oltp_delete_run1.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 502.45 qps: 502.45 (r/w/o: 0.00/502.36/0.10) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 702.50 qps: 702.50 (r/w/o: 0.00/702.30/0.20) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 704.70 qps: 704.70 (r/w/o: 0.00/704.60/0.10) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 544.80 qps: 544.80 (r/w/o: 0.00/544.60/0.20) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 801.60 qps: 801.60 (r/w/o: 0.00/801.40/0.20) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 858.70 qps: 858.70 (r/w/o: 0.00/858.40/0.30) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 590.20 qps: 590.20 (r/w/o: 0.00/589.80/0.40) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1676.90 qps: 1676.90 (r/w/o: 0.00/1675.70/1.20) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 552.70 qps: 552.70 (r/w/o: 0.00/551.80/0.90) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1944.50 qps: 1944.50 (r/w/o: 0.00/1941.80/2.70) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 820.10 qps: 820.10 (r/w/o: 0.00/819.00/1.10) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 2858.60 qps: 2858.60 (r/w/o: 0.00/2854.70/3.90) lat (ms,95%): 2.07 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           125496
        other:                           113
        total:                           125609
    transactions:                        125609 (1042.45 per sec.)
    queries:                             125609 (1042.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1042.4485
    time elapsed:                        120.4942s
    total number of events:              125609

Latency (ms):
         min:                                    0.02
         avg:                                   15.30
         max:                                 1940.97
         95th percentile:                       53.85
         sum:                              1922231.84

Threads fairness:
    events (avg/stddev):           7850.5625/188.49
    execution time (avg/stddev):   120.1395/0.16